
[{
    "id": 1,
    "title": "TRANSITIONAL PROVISIONS",
    "heading": "FIRST SCHEDULE.",
    "part": [{
        "id": 1,
        "heading": "",
        "title": "Part I",
        "content": [{
            "id": 1,
            "title": "FIRST PRESIDENT",
            "content": "1.(1) Notwithstanding anything in this constitution, the person duly electedPresident of Ghana under the law in force immediately before the coming into force of this Constitution shall be taken to have been duly elected for\n\nthe purposes of this Constitution.\n\n(2) The President referred to in subsection (1) of this section shall assume\n\noffice as President on the date of the coming into fo"
        }]
    },
        {
            "id": 2,
            "heading": "",
            "title": "Part II ",
            "content": [{
                "id": 1,
                "title": "FIRST PARLIAMENT",
                "content": "2.(1) Notwithstanding anything in this Constitution, the persons duly elected as members of Parliament under the law in force immediately before the coming into force of this Constitution, shall be taken to have been duly elected members of Parliament for the purposes of this Constitution.\n\n(2) The person who was Clerk of the Consultative Assembly or such other public officer as the Provisional National Defence Council may designate, shall, notwithstanding anything to the contrary in this Constitution, act as Clerk to Parliament until a Clerk is appointed under article 124 of this Constitution.\n\n(3) The person who was Clerk of the Consultative Assembly established under the Consultative Assembly Law 1991 (PNDCL.253) or other person designated under subsection (2) of this section shall, not later than seven days after the coming into force of this Constitution, summon a meeting of parliament for the election of the Speaker, the taking of oaths by members of Parliament, the swearing in of the President and the approval of Ministers of State and Deputy Ministers for appointment under this Constitution.\n\n(4) For the avoidance of doubt, any notice given before the coming into force of this Constitution summoning Parliament to meet for the purposes of subsection (3) of this section, shall be deemed to be a valid notice for all purposes.\n\n(5) The Standing Orders of the Parliament under the constitution of the Republic of Ghana, 1979 shall apply to the proceedings of Parliament until Parliament otherwise determines under article 110 of this Constitution."
            }]
        },
        {
            "id": 3,
            "heading": "",
            "title": "Part III",
            "content": [{
                "id": 1,
                "title": "THE JUDICIARY",
                "content": "3.(1) The Supreme Court, the Court of Appeal and the High Court in existence immediately before the coming into force of this Constitution shall be deemed to have been established under this Constitution and shall perform the functions of the Supreme Court, the Court of Appeal and the High Court specified respectively in Chapter 11 of this Constitution.\n\n(2) All proceedings pending before any court referred to in subsection (1) of this section immediately before the coming into force of this Constitution may be proceeded with and completed in that Court notwithstanding anything in this Constitution.\n\n4.(1) A Justice of the Supreme Court, the Court of Appeal or the the High Court holding office immediately before the coming into force of this Constitution, shall continue to hold office as if appointed to that office under this Constitution.\n\n(2) Any person to whom this section applies shall, on the coming into force of this Constitution, take and subscribe the oath of allegiance and the judicial oath set out in the Second Schedule to this Constitution.\n\n5.The Public Tribunals Board shall cease to exist within six months after the coming into force of this Constitution and its functions, assets and liabilities are transferred to the Judicial Council.\n\n6.Parliament shall, within six months after the coming into force of this Constitution-\n\n(a) prescribe by law the jurisdiction of Regional Tribunals for the purposes of article 143 of this Constitution; and\n\n(b) establish lower courts or tribunals for the purposes of article 126 of this Constitution.\n\n7.(1) All cases partly heard before any of the following Public Tribunals immediately before the coming into force of this Constitution, may be continued and completed before that public tribunal.\n\n(a) the National Public Tribunal;\n\n(b) Regional Public Tribunals;\n\n(c) District Public Tribunals; and\n\n(d) Community Public Tribunals.\n\n(2) All cases partly heard before any Circuit Court, District Court Grade I or District Court Grade II immediately before the coming into force of this Constitution may be continued and completed before the Court.\n\n(3) The National Public Tribunal shall cease to exist upon completion of the partly heard cases referred to in subsection (1) of this section, or within six months after the coming into force of this Constitution, whichever is earlier.\n\n(4) All cases other than those referred to in subsection (1) of this section pending before the National Public Tribunal immediately before the coming into force of this Constitution, shall be transferred to such court of tribunal as the Chief Justice may direct.\n\n(5) Any person employed with any Public Tribunal immediately before the coming into force of this Constitution and who is qualified and suitable for appointment to any office or position in the Judicial Service, may be so appointed if recommended to be appointed by the Judicial Council."
            }]
        },
        {
            "id": 4,
            "heading": "",
            "title": "Part IV",
            "content": [{
                "id": 1,
                "title": "MISCELLANEOUS",
                "content": "8(1) A person who immediately before the coming into force of this Constitution held or was acting in an office in existence immediately before the coming into force of this Constitution, shall be deemed to have been appointed as far as is consistent with the provisions of this Constitution, to hold or act in the equivalent office under this Constitution.\n\n(2) A person who before the coming into force of this Constitution would have been required under the law in force to vacate his office at the expiration of a period of service shall, notwithstanding the provisions of subsection (1) of this section, vacate his office at the expiration of that period.\n\n(3) This section shall be without prejudice to any powers conferred by or under this Constitution or any other law not being inconsistent with any provision of this Constitution, upon any person or authority to make provision for the abolition of office, for the removal from office of persons holding or acting in any office and for requiring those persons to retire from office.\n\n(4) In determining, for the purposes of any law relating to retiring benefits or otherwise to length of service, the length of service of a public officer to whom the provisions of subsections (1) and (2) of this section apply, service as a public officer under the Government which terminates immediately before the coming into force of this Constitution shall be deemed to be continuous with service as a public officer which begins immediately at such coming into force.\n\n(5) A person to whom the provisions of this section apply shall, immediately on the coming into force of this Constitution or at any convenient time thereafter, take and subscribe the oath, if any, required for that office by law.\n\n(6) A person who was entitled to retire on his salary immediately before the coming into force of this Constitution shall have the same terms and condition of service relating to retiring awards as he enjoyed immediately before the coming into force of this Constitution; and accordingly, nothing in this Constitution or in this Schedule shall adversely affect the conditions of service of any such person.\n\n(7) The terms and conditions of service of a person to whom subsection (1) of his section applies shall not be less favourable than those applicable to him immediately before the coming into force of this Constitution.\n\n9.The first appointments to the following offices shall be made within six months after the assumption of office of the President.-\n\n(a) the Commissioner for Human Rights and Administrative Justice and his Deputies;\n\n(b) the District Assemblies Common Fund Administrator;\n\n(c) the Chairman, the Deputy Chairmen and Members of the Electoral Commission;\n\n(d) the Chairmen and other members of\n\n(i) the National Council for Higher Education howsoever described;\n\n(ii) the National Media Commission; and\n\n(iii) the National Commission for Civic Education.\n\n10.Until Parliament enacts an Act of Parliament in accordance with article 192 of this Constitution for the establishment or operation of a public corporation, a public corporation in existence immediately before the coming into force of this Constitution shall continue its operations under the enactment under which it was established.\n\n11.The office of the Ombudsman in existence immediately before the coming into force of this Constitution shall, until the President appoints the Commissioner for Human Rights and Administrative Justice and his Deputies, and provision is otherwise made, continue as if it forms part of the Office of the Commission for Human Rights and Administrative Justice.\n\n12.Notwithstanding anything in this Constitution to the contrary, all cases pending before the Office of Revenue Commissioners established under the Revenue Commissioners Law, 1984 (PNDCL 80) the National Investigations Committee established under the National Investigations Committee Law, 1982 (PNDCL.2) and the State Houses (Allocation Policy and Implementation) Commission established under the State Houses (Allocation Policy and Implementation) Commission law, 1984 (PNDCL 83) in existence immediately before the coming into force of this Constitution may be proceeded with and completed by that Commission or Committee, until the submission of its report or until it is otherwise dissolved in accordance with law.\n\n13.Notwithstanding article 199 of this Constitution, a person is not entitled to receive pension under the Social Security Scheme under the Social Security Law, 1991 (PNDCL 247) before attaining the age of fifty-five years unless Parliament by law otherwise determines\n\n14.\n\n(1) Notwithstanding anything in this Constitution to the contrary any commission or committee of inquiry in existence immediately before the coming into force of this Constitution may continue in existence until the submission of its report or until it is otherwise dissolved in accordance with law.\n\n(2) For the avoidance of doubt, the report and findings of a commission or committee of inquiry established before the coming into force of this Constitution under any enactment shall have the same effect as the report or findings of a commission of inquiry established under this Constitution.\n\n15.Where any matter or thing has been commenced before the coming into force of this Constitution by a person or authority that has power for the purpose under the existing law, that matter or thing may be carried on and completed by the person or authority having power for the purpose after the coming into force of this Constitution; and it shall not be necessary for the person or authority to commence the matter or thing afresh.\n\n16.The Presidential seal, the Public seal, the seals of the Superior Courts as well as any prescribed forms in use under any enactment in force immediately before the coming into force of this Constitution shall continue to be used until provision is otherwise made for them.\n\n17.The prerogative of mercy of the President under article 72 of this Constitution may be exercised in respect of any criminal offence committed before the coming into force of this Constitution as it may in respect of a criminal offence committed thereafter.\n\n18.(1) The Consolidated Fund and the Contingency Fund in existence immediately before the coming into force of this Constitution, shall, until otherwise provided by law, continue in existence as the Consolidated Fund and the the Contingency Fund referred to in article 175 of this Constitution.\n\n(2) Subject to this Constitution, every payment required or authorised to be made into a public fund or out of a public fund under any enactment in force immediately before the coming into force of this Constitution shall continue to be made into or out of that fund.\n\n19.Notwithstanding any law to the contrary, the financial estimates in operation for the financial year in being at the coming into force of this Constitution shall, until provision is otherwise made by Act of Parliament, continue and shall have full effect.\n\n20.All compensations, pensions, gratuities and similar allowances granted in accordance with the provisions of any Constitution or any other law formerly in force in Ghana and which were payable immediately before the coming into force of this Constitution, shall, notwithstanding the abrogation or repeal of any such Constitution or law, as the case may be, continue to be payable and are charged on the Consolidated Fund.\n\n21.Where immediately before the coming into force of this Constitution any existing enactment had not been brought into force or was to come into force on a date subsequent to such coming into force, the enactment may be brought into force in accordance with its terms, or shall come into force upon such subsequent date, as the case may be.\n\n22.(1) The register of voters for public election and referenda in existence immediately before the coming into force of this Constitution shall, on the coming into force of this Constitution, have effect as if it was compiled under this Constitution.\n\n(2) Subject to this Constitution, the Interim National Electoral Commission in existence immediately before the coming into force of this Constitution shall, on the coming into force of this Constitution and until the President appoints the members of the Electoral Commission under section 9 of this Schedule, exercise the functions and powers provided for the Electoral Commission in this Constitution.\n\n23.(1) Until Parliament otherwise provides by law, existing laws regulating the operation of District Assemblies and other local authorities shall continue to regulate their operations.\n\n(2) Until Parliament establishes the District Assemblies Common Fund in accordance with article 252 of this Constitution, all taxes and other moneys collected exclusively for District Assemblies shall continue to be collected exclusively for District Assemblies under the enactments under which they were collected.\n\n24.The National House of Chiefs, the Regional Houses of Chiefs, the traditional councils and all Judicial Committees of those bodies in existence immediately before the coning into force of this Constitution shall, on the coming into force of this Constitution, continue in existence subject to this Constitution.\n\n25.The Oaths Decree, 1972 (NRCD 6), as amended, shall have effect subject to the provisions of this Constitution.\n\n26.Except where the context otherwise requires and subject to the other provisions of this Part, in all enactments in existence immediately before the coming into force of this Constitution -\n\n(a) for any reference to the Provisional National Defence the Cabinet;\n\n(b) for any reference to the Secretary to the Provisional National Defence Council where the reference relates to the Cabinet the reference shall be a reference to the Secretary to the Cabinet,\n\n(c) any reference to the Secretary to the Committee of Secretaries shall be a reference to the Head of the Civil Service;\n\n(d) for any reference to a Secretary, being an individual of ministerial rank, there shall be substituted a reference to a Minister;\n\n(e) for any reference to a Member of the Provisional National Defence Council responsible for any subject or department of State there shall be substituted a reference to the Minister responsible for that subject or department of State\n\n27.In this Constitution, any reference to the Chief of Defence Staff shall be deemed to include any person who holds or held the office of General Officer Commanding.\n\n28.(1) A reference to the Government in an enactment in existence immediately before the coming into force of this Constitution, where the reference relates to a legislative function normally performed by Parliament or a National Assembly shall be construed as a reference to Parliament.\n\n(2) A reference to the Government in an enactment in existence immediately before the coming into force of this Constitution, where the reference relates to an executive function of the Government, shall be construed as a reference to the President.\n\n29.(1) A reference to the Provisional National Defence Council in any enactment in existence immediately before the coming into force of this Constitution, where the reference was originally a reference to the President shall, be construed as a reference to the President.\n\n(2) A reference to the Provisional National Defence Council in any enactment in existence immediately before the coming into force of this Constitution, where the reference relates to a legislative function normally performed by Parliament or a National Assembly shall be construed as a reference to Parliament.\n\n(3) A reference to the Provisional national Defence Council in any enactment in existence immediately before the coming into force of this Constitution, where the reference relates to an executive function of the Council shall be construed as a reference to the President.\n\n(4) A reference to the Provisional national Defence Council in any enactment in existence immediately before the coming into force of this Constitution, where the reference relates to the making of a statutory instrument, shall be construed as a reference to the President or to any Minister or authority designated by the President.\n\n30.The First President under this Constitution may, at any time within twelve months after assuming office as President, by constitutional instrument, make such provision as may appear necessary for repealing, modifying, adding to or adapting any law for bringing it into accord with the provisions of this Constitution or otherwise for giving effect to this Constitution.\n\n31.(1) Where any matter that falls to be prescribed or otherwise provided for under this Constitution by Parliament or by any other authority or person, is prescribed or provided for by or under any existing law or is otherwise lawfully prescribed or provided for immediately before the coming into force of this Constitution, that prescription or provision shall, as from the coming into force of this Constitution, have effect with such modifications, adaptations, qualifications and exceptions as may be necessary to bring it into conformity with this constitution as if made under this Constitution by parliament or, as the case may be, by the other authority or person.\n\n(2) For the avoidance of doubt, and without prejudice to the general effect of subsection (1) of this section, where anything is required or authorised by this Constitution to be prescribed or provided for by or under an Act of Parliament, it shall be deemed to be duly prescribed or provided for, if it has been prescribed or provided for by or under an Act, Decree, or a Law in force immediately before the coming into force of this Constitution.\n\n32.(1) Subject to the provisions of articles 257 and 258 of this Constitution, all properties and assets which immediately before the coming into force of this Constitution were vested in any authority or person for the purposes of, or in right of, the Government of Ghana or in the Government of Ghana, shall, on the coming into force of this Constitution, without further assurance than this section, vest in the President.\n\n(2) Any property which was liable, immediately before the coming into force of this Constitution, to estreat or to be forfeited to the Government of Ghana shall be liable to estreat or to be forfeited to the Government of Ghana under this Constitution.\n\n(3) Where immediately before the coming into force of this Constitution any person held any property or asset in trust -\n\n(a) for the President of Ghana under the Constitution that was abrogated on 31st December, 1981; or\n\n(b) for the Provisional National Defence Council or the Government of Ghana;\n\nfor the purposes of, or in right of, the Government of Ghana, that person shall, on the coming into force of this Constitution, hold the property or asset subject to the provisions of articles 257 and 258 of this Constitution, on the same trust for the Government of Ghana established under this Constitution.\n\n(4) In this section, references to property and assets vested in or held in trust shall include property and assets vested in or held in trust immediately before the 31st day of December 1981, for an interest which extended beyond the 30th day of December, 1981 and has not been surrendered.\n\n33. Subject to section 32 of this Schedule -\n\n(a) where under an existing law, a right, prerogative, power, privilege or function is vested in the Provisional National Defence Council, that right, prerogative, power, privilege or function shall on the coming into force of this Constitution, vest in the President or such other person or authority as is specified under this Constitution who, subject to the provisions of this Constitution or any other law, may do all things necessary for its exercise or performance; and\n\n(b) any right, power, privilege, obligation, liability, duty or function vested in, or subsisting against the Government of Ghana by or under an existing law shall continue to so vest or subsist.\n\n34. (1) No member of the Provisional National Defence Council, Provisional National defence Council Secretary, or other appointees of the Provisional National Defence Council shall be held liable either jointly or severally, for any act or omission during the administration of the Provisional National Defence Council.\n\n(2) It is not lawful for any court or tribunal to entertain any action or take any decision or make any order or grant any remedy or relief in any proceedings instituted against the Government of Ghana or any person acting under the authority of the Government of Ghana whether before or after the coming into force of this Constitution or against any person or persons acting in concert or individually to assist or bring about the change in Government which took place on the twenty-fourth day of February 1966 on the thirteenth day of January, 1972, on the fourth day of June 1979 and on the thirty-first day of December 1981 in respect of any act or omission relating to, or consequent upon -\n\n(a) the overthrow of the government in power before the formation of the National Liberation council, the National Redemption Council, the Supreme Military Council, the Armed Forces Revolutionary Council and the Provisional National Defence Council; or\n\n(b) the suspension or a abrogation of the Constitutions of 1960, 1969 and 1979; or\n\n(c) the establishment of the National Liberation Council, the National Redemption Council, the Supreme Military Council which took office on the ninth day of October 1975, the Supreme Military Council established on the fifth day of July 1978, the Armed Forces Revolutionary Council, or the Provisional National Defence Council; or\n\n(d) the establishment of this Constitution.\n\n(3) For the avoidance of doubt, it is declared that no executive, legislative or judicial action taken or purported to have been taken by the Provisional National Defence Council or the Armed Forces Revolutionary Council or a member of the Provisional National Defence Council or the Armed Forces Revolutionary Council or by any person appointed by the Provisional National Defence Council or the Armed Forces Revolutionary Council or by any person appointed by the Provisional National Defence Council or the Armed Forces Revolutionary Council in the name of either the Provisional National Defence Council or the Armed Forces Revolutionary Council shall be questioned in any proceedings whatsoever and, accordingly, it shall not be lawful for any court or other tribunal to make any order or grant any remedy or relief in respect of any such act.\n\n(4) The provisions of subsection (3) of this section shall have effect notwithstanding that any such action as is referred to in that subsection was not taken in accordance with any procedure prescribed by law.\n\n(5) It is not lawful for any court or tribunal to entertain an action instituted in respect of an act or omission against a person acting or omitting to act, on the instructions or authority of the Provisional National Defence Council or the Armed Forces Revolutionary Council or a member of the Provisional national Defence Council or the Armed Forces Revolutionary council and alleged to be in contravention of any law, whether substantive or procedural, in existence before or during the administration of the Provisional National Defence Council or the Armed Forces Revolutionary Council.\n\n35. 1) Subject to subsection (2) of this section, any confiscation of any property and any other penalties imposed by or under the authority of the Armed Forces Revolutionary Council and the provisional national Defence Council under any Decree or Law made by that Council, shall not be reversed by any authority under this Constitution.\n\n(2) Where any property or part of any property of a person was confiscated on the basis of his holding a public or political office or on any other basis, and it is established to the satisfaction of the Commissioner for Human Rights and Administrative Justice that the property or that part was acquired before he assumed the public or political office, or that it was otherwise lawfully acquired, the property or that part shall be returned to that person.\n\n36. (1) Upon the coming into force of this Constitution, the Provisional National Defence council (Establishment) Proclamation 1981 and the Provisional national Defence Council (Establishment) Proclamation (Supplementary and consequential Provisions) Law, 1982 (PNDCL 42) shall cease to have effect.\n\n(2) Notwithstanding the abrogation of the Proclamation referred to in subsection (1) of this section, any enactment or rule of law in force immediately before the coming into force of this Constitution shall, in so far as it is not inconsistent with a provision of this Constitution, continue in force as if enacted, issued, or made under the authority of this Constitution.\n\n37. nNotwithstanding anything in Chapter 25 of this Constitution, Parliament shall have no power to amend this section or sections 34 and 35 of this Schedule."
            }]
        }
    ]
},
    {
        "id": 1,
        "title": "FORMS OF OATH",
        "heading": "SECOND SCHEDULE",
        "part": [{
            "id": 1,
            "heading": "",
            "title": "",
            "content": [{
                "id": 1,
                "title": "1. THE OATH OF ALLEGIANCE",
                "content": "I,...................................................................................... do (in the name of the Almighty God swear) (solemnly affirm) that I will bear true faith and allegiance to the Republic of Ghana as by law established; that I will uphold the sovereignty and integrity of Ghana; and that I will preserve, protect and defend the Constitution of the Republic of Ghana. (So help me God).\n\nTo be sworn before the President, the Chief Justice or such other person as the President may designate."
            }]
        },
            {
                "id": 2,
                "heading": "",
                "title": "",
                "content": [{
                    "id": 1,
                    "title": "2. THE PRESIDENTIAL OATH",
                    "content": "I,...................................................................................... having been elected to the high office of President of the Republic of Ghana do (in the name of the Almighty God swear) (solemnly affirm) that I will be faithful and true to the Republic of Ghana; that I will at all times preserve, protect and defend the Constitution of the Republic of Ghana; and that I dedicate myself to the service and well-being of the people of the Republic of Ghana and to do right to all manner of persons.\n\nI further (solemnly swear) (solemnly affirm) that should I at any time break this oath of office I shall submit myself to the laws of the Republic of Ghana and suffer the penalty for it. (So help me God).\n\nTo be administered by the Chief Justice before Parliament."
                }]
            },
            {
                "id": 3,
                "heading": "",
                "title": "",
                "content": [{
                    "id": 1,
                    "title": "3. THE OATH OF THE VICE-PRESIDENT",
                    "content": "I.......................................................................................... having been elected to the office of Vice-President of the Republic of Ghana, do (in the name of the Almighty God swear) (solemnly affirm) that I will be faithful and true to the Republic of Ghana; that 1 will at all times preserve, protect and defend the Constitution of the Republic of Ghana; and I dedicate myself to the service and well-being of the people of the Republic of Ghana and to do right to all manner of persons.\n\nI further (solemnly swear) (solemnly affirm) that should I at any time break this oath of office, I shall submit myself to the laws of the Republic of Ghana and suffer the penalty for it. (So help me God).\n\nTo be administered by the Chief Justice before Parliament."
                }]
            },
            {
                "id": 4,
                "heading": "",
                "title": "",
                "content": [{
                    "id": 1,
                    "title": "4. THE JUDICIAL OATH",
                    "content": "I,.......................................................................................... having been appointed (Chief Justice/a Justice of the Supreme Court/a Justice of the Court of Appeal/a Justice of the High Court of Justice, etc.) do (in the name of the Almighty God swear) (solemnly affirm) that I will bear true faith and allegiance to the Republic of Ghana as by law established; that I will uphold the sovereignty and integrity of the Republic of Ghana; and that I will truly and faithfully perform the functions of my office without fear or favour, affection or ill-will; and that I will at all times uphold, preserve, protect and defend the Constitution and laws of the Republic of Ghana. (So help me God).\n\nTo be sworn before the President, the Chief Justice or such other person as the Chief Justice may designate."
                }]
            },
            {
                "id": 5,
                "heading": "",
                "title": "5. THE OATH OF MEMBER OF COUNCIL OF STATE",
                "content": [{
                    "id": 1,
                    "title": "5. THE OATH OF MEMBER OF COUNCIL OF STATE",
                    "content": "I,.............................................................................................. do (solemnly swear in the name of the Almighty God) (solemnly affirm) that I will faithfully and conscientiously perform my duties as a member of the Council of State and uphold, preserve, protect and defend the Constitution of the Republic of Ghana. (So help me God).\n\nTo be sworn before the President."
                }]
            },
            {
                "id": 6,
                "heading": "",
                "title": "",
                "content": [{
                    "id": 1,
                    "title": "6. THE CABINET OATH",
                    "content": "I,............................................................................................ having been appointed a member of the Cabinet do (in the name of the Almighty God swear) (solemnly affirm) that I will not directly or indirectly reveal such matters as shall be debated in the Cabinet and committed to my secrecy; and that I will uphold, preserve, protect and defend the Constitution of the Republic of Ghana. (So help me God).\n\nTo be sworn before the President."
                }]
            },
            {
                "id": 7,
                "heading": "",
                "title": "",
                "content": [{
                    "id": 1,
                    "title": "7. THE OATH OF MINISTER OF STATE",
                    "content": "I.............................................................................................. having been appointed Minister of State (Deputy Minister) of the Republic of Ghana, do (in the name of the Almighty God swear) (solemnly affirm) that I will at all times well and truly serve the Republic of Ghana in the office of Minister of State (Deputy Minister); that I will uphold, preserve, protect and defend the Constitution of the Republic of Ghana as by law established; that I will, to the best of my judgment, at all times when required, freely give my counsel and advice for the good management of the public affairs of the Republic of Ghana; and that I will not directly or indirectly reveal any matters that shall come to my knowledge in the discharge of my duties and committed to my secrecy as Minister of State (Deputy Minister). (So help me God).\n\nTo be sworn before the President."
                }]
            },
            {
                "id": 8,
                "heading": "",
                "title": "",
                "content": [{
                    "id": 1,
                    "title": "8. THE OATH OF SECRECY",
                    "content": "I,............................................................................................... holding the office of ............................................................... do (in the name of the Almighty God swear) (solemnly affirm) that I will not directly or indirectly communicate or reveal to any person any matter which shall be brought under my consideration or shall come to my knowledge in the discharge of my official duties except as may be required for the discharge of my official duties or as may be specially permitted by law. (So help me God).\n\nTo be sworn before the President, the Chief Justice or such other person as the President may designate."
                }]
            },
            {
                "id": 9,
                "heading": "",
                "title": "9. THE OFFICIAL OATH",
                "content": [{
                    "id": 1,
                    "title": "",
                    "content": "I,............................................................................................ do (in the name of the Almighty God swear) (solemnly affirm) that 1 will at all times well and truly serve the Republic of Ghana in the office of ..................................................................... and that I will uphold, preserve, protect and defend the Constitution of the Republic of Ghana as by law' established. (So help me God).\n\nTo be sworn before the President or such other person as the President may designate."
                }]
            },
            {
                "id": 10,
                "heading": "",
                "title": "",
                "content": [{
                    "id": 1,
                    "title": "10. THE SPEAKER'S OATH",
                    "content": "I,............................................................................................. do (in the name of the Almighty God swear) (solemnly affirm) that I will bear true faith and allegiance to the Republic of Ghana as by law established; that I will uphold the integrity of the Republic of Ghana; that I will faithfully and conscientiously discharge my duties as Speaker of Parliament; and that I will uphold, preserve, protect and defend the Constitution of the Republic of Ghana; and that I will do right to all manner of persons in accordance with the Constitution of Ghana and the laws and conventions of Parliament without fear or favour, affection or ill-will. (So help me God).\n\nTo be sworn before the Chief Justice."
                }]
            },
            {
                "id": 11,
                "heading": "",
                "title": "",
                "content": [{
                    "id": 1,
                    "title": "11. THE OATH OF A MEMBER OF PARLIAMENT",
                    "content": "I,........................................................................................... having been elected a member of Parliament do (in the name of the Almighty God swear) (solemnly affirm) that I will bear true faith and allegiance to the Republic of Ghana as by law established; that I will uphold, preserve, protect and defend the Constitution of the Republic of Ghana; and that I will faithfully and conscientiously discharge the duties of a member of Parliament. (So help me God).\n\nTo be sworn before the Speaker."
                }]
            },
            {
                "id": 12,
                "heading": "",
                "title": "",
                "content": [{
                    "id": 1,
                    "title": "12. THE OATH OF THE AUDITOR-GENERAL",
                    "content": "I,......................................................................................... having been appointed Auditor-General of the Republic of Ghana do (in the name of the Almighty God swear) (solemnly affirm) that I will bear true faith and allegiance to the Republic of Ghana; that I will uphold, preserve, protect and defend the Constitution of the Republic of Ghana; and that I will truly and faithfully perform the functions of my office without fear or favour, affection or ill-will. (So help me God).\n\nTo be sworn before the President, or such other person as the President may designate."
                }]
            }
        ]
    }
]
